mbovero/ECE5780_2-Axis_Gimbal_Claw/STM32/Src/gimbal_controller.c
#include <stm32f0xx_hal.h>
#include "main.h"
#include <assert.h>
#include "hal_gpio.h"
#include "bno085.h"
#include "motor_control.h"
#include "quaternion.h"
#include "debugUART.h"
#include "config.h"
#include "joystick_led.h"

// Parsed and Q14-formatted quaternion data representing TARGET orientation
volatile int16_t ti, tj, tk, tr;    

// Parsed and Q14-formatted quaternion data representing CURRENT orientation
volatile int16_t ci, cj, ck, cr;

// I2C handle for I2C2
I2C_HandleTypeDef hi2c2;

// UART handle for UART1
UART_HandleTypeDef huart1;
static int uart_loop_counter = 0;

// Status bit indicating current gimbal mode
volatile uint8_t manual_control = 0;

int gimbal_controller(void)
{
    HAL_Init();                  // Initialize HAL
    motor_init();                // Initialize GPIO pins and peripherals for motor control
    stm_bno085_i2c_init(&hi2c2); // Initialize GPIO pins and peripherals for IMU communication
    bno085_init(&hi2c2);         // Reset, initialize, and configure the IMU
    debugUART_init(&huart1);     // Initialize GPIO pins and peripherals for UART debugging
    //joystick_init();             // Initialize joystick

    // Initialize pin as status LED
    GPIO_InitTypeDef initStrPB4_5 = {GPIO_PIN_4 | GPIO_PIN_5, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW};
    HAL_GPIO_Init(GPIOB, &initStrPB4_5);


 
    // Initialize user button PA0 as system kill switch
    GPIO_InitTypeDef initStrPA0 = {GPIO_PIN_0,
        GPIO_MODE_INPUT,
        GPIO_PULLDOWN,
        GPIO_SPEED_FREQ_LOW};
    My_HAL_GPIO_Init(GPIOA, &initStrPA0);             // Initialize pin PA0 (USER Button)

    __HAL_RCC_SYSCFG_CLK_ENABLE();
    SYSCFG->EXTICR[0] &= ~(0xF);        // EXTI0 outputs from PA0
    EXTI->IMR |= EXTI_IMR_IM0;          // Enable interrupts on line 0
    EXTI->RTSR |= EXTI_RTSR_TR0;        // Enable rising edge trigger for line 0
    NVIC_EnableIRQ(EXTI0_1_IRQn);       // Enable EXTI0 interrupt
    NVIC_SetPriority(EXTI0_1_IRQn, 0);  // Set priority for EXTI0 to 0 (highest-priority)


    // Initialize gpio pin PA1 for joystick button
    GPIO_InitTypeDef initStrPA1 = {GPIO_PIN_1,
        GPIO_MODE_INPUT,
        GPIO_PULLUP,
        GPIO_SPEED_FREQ_LOW};
    My_HAL_GPIO_Init(GPIOA, &initStrPA1);       


    // Configure PA1 for EXTI1
    SYSCFG->EXTICR[0] &= ~(0xF << 4);    // Clear EXTI1[7:4]
    SYSCFG->EXTICR[0] |= (0x0 << 4);     // Set EXTI1 to PA1 (0x0)
    EXTI->IMR |= EXTI_IMR_IM1;           // Enable interrupts on line 0
    EXTI->RTSR |= EXTI_RTSR_TR1;         // Enable rising edge trigger for line 0
    NVIC_EnableIRQ(EXTI0_1_IRQn);        // Already shared with EXTI0
    NVIC_SetPriority(EXTI0_1_IRQn, 0);


    void EXTI0_1_IRQHandler();  // Declare handler for line 0 interrupt








    __HAL_RCC_ADC1_CLK_ENABLE();
    


    // PC2 (vx) and PC3 (vy) as analog inputs
    GPIO_InitTypeDef analogPins = {
        .Pin = GPIO_PIN_3,
        .Mode = GPIO_MODE_ANALOG,
        .Pull = GPIO_NOPULL
    };
    HAL_GPIO_Init(GPIOC, &analogPins);

    GPIO_InitTypeDef analogPins2 = {
        .Pin = GPIO_PIN_5,
        .Mode = GPIO_MODE_ANALOG,
        .Pull = GPIO_NOPULL
    };
    HAL_GPIO_Init(GPIOA, &analogPins2);

    // PA1 as digital input (override pin)
    GPIO_InitTypeDef dioPin = {
        .Pin = GPIO_PIN_1,
        .Mode = GPIO_MODE_INPUT,
        .Pull = GPIO_PULLUP  // assumes button pulls low when pressed
    };
    HAL_GPIO_Init(GPIOA, &dioPin);

    // ADC config: 8-bit resolution, single conversion
    ADC1->CFGR1 &= ~(ADC_CFGR1_RES | ADC_CFGR1_CONT | ADC_CFGR1_EXTEN);
    ADC1->CFGR1 |= (0b10 << ADC_CFGR1_RES_Pos); // 8-bit resolution

    // ADC calibration
    if (ADC1->CR & ADC_CR_ADEN) {
        ADC1->CR |= ADC_CR_ADDIS;
    }
    while (ADC1->CR & ADC_CR_ADEN);
    ADC1->CR |= ADC_CR_ADCAL;
    while (ADC1->CR & ADC_CR_ADCAL);

    // Enable ADC
    ADC1->CR |= ADC_CR_ADEN;
    while (!(ADC1->ISR & ADC_ISR_ADRDY));









    // Use initial IMU rotation vector as target orientation
    bno085_read_rotation_vector(&hi2c2, &ci, &cj, &ck, &cr);
    ti = ci;
    tj = cj;
    tk = ck;
    tr = cr;


    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, GPIO_PIN_SET);



    // Main while loop
    while (1)
    {

        // if (++uart_loop_counter >= 100) {
        //     uart_print_int(&huart1, ti);
        //     uart_print_int(&huart1, tj);
        //     uart_print_int(&huart1, tk);
        //     uart_print_int(&huart1, tr);
        //     uart_loop_counter = 0;
        // }



        if (manual_control)     // Manual mode
        {
            bno085_read_rotation_vector(&hi2c2, &ci, &cj, &ck, &cr);

            //--- Read vx (PC0, CH10) ---
            ADC1->CHSELR = ADC_CHSELR_CHSEL5;
            ADC1->CR |= ADC_CR_ADSTART;
            while (!(ADC1->ISR & ADC_ISR_EOC));
            uint8_t vx = ADC1->DR;
            HAL_Delay(1); 
            // --- Read vy (PC3, CH13) ---
            ADC1->CHSELR = ADC_CHSELR_CHSEL13;
            ADC1->CR |= ADC_CR_ADSTART;
            while (!(ADC1->ISR & ADC_ISR_EOC));
            uint8_t vy = ADC1->DR;

            
            if (vy > 140)
            {
                vy = 140;
            }
           

            uint8_t vy_abs = abs(vy);

            if(abs(vy-70) >= 60)
            { 
                TIM2->PSC = 40;
                //roll_motor_set_speed(950);
            }
            else if(abs(vy-70) >= 40)
            { 
                TIM2->PSC = 70;
                //roll_motor_set_speed(700);
            }
            else if(abs(vy-70) >= 40)
            { 
                TIM2->PSC = 249;
                //roll_motor_set_speed(500);
            }
        
            if (abs(vy-70) >= 30)
            {
                (vy-70 > 0) ? roll_motor_set_dir(0) : roll_motor_set_dir(1);
                roll_motor_resume();
            }
            else
            {   
                roll_motor_stop();
            }



            if(abs(vx-70) >= 60)
            { 
                TIM3->PSC = 40;
                //roll_motor_set_speed(950);
            }
            else if(abs(vx-70) >= 40)
            { 
                TIM3->PSC = 80;
                //roll_motor_set_speed(700);
            }
            
        
            if (abs(vx-70) >= 30)
            {
                (vx-70 > 0) ? yaw_motor_set_dir(0) : yaw_motor_set_dir(1);
                yaw_motor_resume();
            }
            else
            {   
                yaw_motor_stop();
            }
        

        }
        else    // Gimbal Mode
        {   
            //HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, GPIO_PIN_SET);
            // Attempt to read quaternion data from IMU
            if (bno085_read_rotation_vector(&hi2c2, &ci, &cj, &ck, &cr))
            {
                // If communication fails, stop rotating motors
                roll_motor_stop();
                yaw_motor_stop();
                continue;
            }

            // Compute errors for each axis of rotation
            int16_t err_roll  = compute_roll_error(cr, ci, cj, ck, tr, ti, tj, tk);
            int16_t err_yaw   = compute_yaw_error(cr, ci, cj, ck, tr, ti, tj, tk);

            // if (++uart_loop_counter >= 100) {
            //     uart_print_int(&huart1, err_roll);
            //     uart_loop_counter = 0;
            // }
            if(!manual_control){
                roll_motor_set_speed_direction(err_roll);
                yaw_motor_set_speed_direction(err_yaw);
            }
            

            HAL_Delay(2); // TODO remove or change?
        }
    }
}

void EXTI0_1_IRQHandler()
{
    static uint32_t last_interrupt_time_pa1 = 0;
    static uint32_t last_interrupt_time_pa0 = 0;
    uint32_t current_time = HAL_GetTick();

    // Check EXTI1 (PA1 Joystick Button)
    if (EXTI->PR & EXTI_PR_PR1) {
        EXTI->PR |= EXTI_PR_PR1; // clear pending flag

        if (current_time - last_interrupt_time_pa1 > 200) {
            last_interrupt_time_pa1 = current_time;

            manual_control = !manual_control;

            if (!manual_control) {
                ti = ci;
                tj = cj;
                tk = ck;
                tr = cr;
                HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, GPIO_PIN_RESET);
                HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, GPIO_PIN_SET);
            } else {
                roll_motor_stop();
                yaw_motor_stop();
                HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, GPIO_PIN_SET);
                HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, GPIO_PIN_RESET);
            }
        }
    }

    // Check EXTI0 (PA0 User Button)
    if (EXTI->PR & EXTI_PR_PR0) {
        EXTI->PR |= EXTI_PR_PR0; // clear pending flag

        if (current_time - last_interrupt_time_pa0 > 200) {
            last_interrupt_time_pa0 = current_time;

            roll_motor_stop();
            yaw_motor_stop();

            while (1);
        }
    }
}
